Revit 2027 API
ControlledApplication.FamilyLoadingIntoDocument Event
 Subscribe to the FamilyLoadingInto event to be notified when Revit is just about to load a family into a document.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<FamilyLoadingIntoDocumentEventArgs> FamilyLoadingIntoDocument
Public Event FamilyLoadingIntoDocument As EventHandler(Of FamilyLoadingIntoDocumentEventArgs)
public:
 event EventHandler<FamilyLoadingIntoDocumentEventArgs^>^ FamilyLoadingIntoDocument {
	void add (EventHandler<FamilyLoadingIntoDocumentEventArgs^>^ value);
	void remove (EventHandler<FamilyLoadingIntoDocumentEventArgs^>^ value);
}
member FamilyLoadingIntoDocument : IEvent<EventHandler<FamilyLoadingIntoDocumentEventArgs>,
    FamilyLoadingIntoDocumentEventArgs>
Value
EventHandler<FamilyLoadingIntoDocumentEventArgs>
Remarks
This event is raised when Revit is just about to load a family into a document.
 Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True. Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Import()
Close() and similar overloads.
Save() .
SaveAs(String) and similar overloads.
Exception InvalidOperationException will be thrown if any of the above methods is called during this event.
Another FamilyLoadedIntoDocument event will be raised immediately after family loading is finished.
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace